#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
module.networks.google_compute_network.duc_bac_cloudrun_network: Refreshing state... [id=projects/infrateam-playground/global/networks/duc-bac-cloudrun-network]
module.networks.google_compute_address.duc_bac_nat_ip: Refreshing state... [id=projects/infrateam-playground/regions/asia-southeast1/addresses/duc-bac-nat-ip]
module.networks.google_compute_router.duc_bac_router: Refreshing state... [id=projects/infrateam-playground/regions/asia-southeast1/routers/duc-bac-router]
module.networks.google_compute_subnetwork.duc_bac_subnetwork: Refreshing state... [id=projects/infrateam-playground/regions/asia-southeast1/subnetworks/duc-bac-subnetwork]
google_cloud_run_service.duc-bac-nginx-service: Refreshing state... [id=locations/asia-southeast1/namespaces/infrateam-playground/services/duc-bac-nginx-service]
module.networks.google_compute_router_nat.duc_bac_nat_gateway: Refreshing state... [id=infrateam-playground/asia-southeast1/duc-bac-router/duc-bac-nat-gateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.duc-bac-nginx-service will be updated in-place
  ~ resource "google_cloud_run_service" "duc-bac-nginx-service" {
        id                         = "locations/asia-southeast1/namespaces/infrateam-playground/services/duc-bac-nginx-service"
        name                       = "duc-bac-nginx-service"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  ~ "autoscaling.knative.dev/maxScale"        = "100" -> "10"
                  + "autoscaling.knative.dev/minScale"        = "0"
                  + "run.googleapis.com/vpc-access-connector" = "duc-bac-vpc-connector"
                  + "run.googleapis.com/vpc-access-egress"    = "all-traffic"
                }
                name             = null
                # (6 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.networks.google_vpc_access_connector.duc_bac_serverless_vpc_connector will be created
  + resource "google_vpc_access_connector" "duc_bac_serverless_vpc_connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.15.0.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = (known after apply)
      + max_throughput     = 300
      + min_instances      = (known after apply)
      + min_throughput     = 200
      + name               = "duc-bac-vpc-connector"
      + network            = "duc-bac-cloudrun-network"
      + project            = "infrateam-playground"
      + region             = "asia-southeast1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @bacducdinh, Action: `pull_request`*